alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/pp3/m400_pp_3_ibr02_run.c
  Mali_WrReg(0x1,0x0,0x0,0x25564423);                /* writereg 10000000 25564423 */
  Mali_WrReg(0x1,0x0,0x4,0x34445655);                /* writereg 10000004 34445655 */
  Mali_WrReg(0x1,0x0,0x8,0x46345675);                /* writereg 10000008 46345675 */
  Mali_WrReg(0x1,0x0,0xc,0xaabb3455);                /* writereg 1000000c aabb3455 */
  Mali_WrReg(0x1,0x0,0x10,0x32456326);               /* writereg 10000010 32456326 */
  Mali_WrReg(0x1,0x0,0x14,0x34562313);               /* writereg 10000014 34562313 */
  Mali_WrReg(0x1,0x0,0x18,0x23465235);               /* writereg 10000018 23465235 */
  Mali_WrReg(0x1,0x0,0x1c,0x23435541);               /* writereg 1000001c 23435541 */
  Mali_WrReg(0x1,0x0,0x20,0x62453564);               /* writereg 10000020 62453564 */
  Mali_WrReg(0x1,0x0,0x24,0x34563256);               /* writereg 10000024 34563256 */
  Mali_WrReg(0x1,0x0,0x28,0x23466653);               /* writereg 10000028 23466653 */
  Mali_WrReg(0x1,0x0,0x2c,0x45673422);               /* writereg 1000002c 45673422 */
  Mali_WrReg(0x1,0x0,0x30,0x23456767);               /* writereg 10000030 23456767 */
  Mali_WrReg(0x1,0x0,0x34,0x23453423);               /* writereg 10000034 23453423 */
  Mali_WrReg(0x1,0x0,0x38,0x13246676);               /* writereg 10000038 13246676 */
  Mali_WrReg(0x1,0x0,0x3c,0x01123433);               /* writereg 1000003c 01123433 */
  Mali_WrReg(0x1,0x0,0x40,0x36546756);               /* writereg 10000040 36546756 */
  Mali_WrReg(0x1,0x0,0x44,0x14545656);               /* writereg 10000044 14545656 */
  Mali_WrReg(0x1,0x0,0x48,0x67835344);               /* writereg 10000048 67835344 */
  Mali_WrReg(0x1,0x0,0x4c,0x24564556);               /* writereg 1000004c 24564556 */
  Mali_WrReg(0x1,0x0,0x50,0x948b6f21);               /* writereg 10000050 948b6f21 */
  Mali_WrReg(0x1,0x0,0x54,0xbc7d2531);               /* writereg 10000054 bc7d2531 */
  /* COMMENT */                                      /* #- Writeback registers WB0 */
  Mali_WrReg(0x1,0x0,0x100,0x36457677);              /* writereg 10000100 36457677 */
  Mali_WrReg(0x1,0x0,0x104,0x65787686);              /* writereg 10000104 65787686 */
  Mali_WrReg(0x1,0x0,0x108,0x04784450);              /* writereg 10000108 04784450 */
  Mali_WrReg(0x1,0x0,0x10c,0x65787600);              /* writereg 1000010c 65787600 # Setting high/low part at same time is undefined */
  Mali_WrReg(0x1,0x0,0x110,0x46786445);              /* writereg 10000110 46786445 */
  Mali_WrReg(0x1,0x0,0x114,0x12342345);              /* writereg 10000114 12342345 */
  Mali_WrReg(0x1,0x0,0x118,0x42563462);              /* writereg 10000118 42563462 */
  Mali_WrReg(0x1,0x0,0x11c,0x34576700);              /* writereg 1000011c 34576700 */
  Mali_WrReg(0x1,0x0,0x120,0x76834223);              /* writereg 10000120 76834223 */
  Mali_WrReg(0x1,0x0,0x124,0x34534643);              /* writereg 10000124 34534643 */
  Mali_WrReg(0x1,0x0,0x128,0x65466654);              /* writereg 10000128 65466654 */
  Mali_WrReg(0x1,0x0,0x12c,0x65468798);              /* writereg 1000012c 65468798 */
  /* COMMENT */                                      /* #- Writeback registers WB1 */
  Mali_WrReg(0x1,0x0,0x200,0x22323440);              /* writereg 10000200 22323440 */
  Mali_WrReg(0x1,0x0,0x204,0x02456456);              /* writereg 10000204 02456456 */
  Mali_WrReg(0x1,0x0,0x208,0x03436565);              /* writereg 10000208 03436565 */
  Mali_WrReg(0x1,0x0,0x20c,0x65465500);              /* writereg 1000020c 65465500 # Setting high/low part at same time is undefined */
  Mali_WrReg(0x1,0x0,0x210,0x98436216);              /* writereg 10000210 98436216 */
  Mali_WrReg(0x1,0x0,0x214,0x65498436);              /* writereg 10000214 65498436 */
  Mali_WrReg(0x1,0x0,0x218,0x65494685);              /* writereg 10000218 65494685 */
  Mali_WrReg(0x1,0x0,0x21c,0x02342315);              /* writereg 1000021c 02342315 */
  Mali_WrReg(0x1,0x0,0x220,0x76451355);              /* writereg 10000220 76451355 */
  Mali_WrReg(0x1,0x0,0x224,0x65215723);              /* writereg 10000224 65215723 */
  Mali_WrReg(0x1,0x0,0x228,0x05673564);              /* writereg 10000228 05673564 */
  Mali_WrReg(0x1,0x0,0x22c,0x12345560);              /* writereg 1000022c 12345560 */
  /* COMMENT */                                      /* #- Writeback registers WB2 */
  Mali_WrReg(0x1,0x0,0x300,0x65498433);              /* writereg 10000300 65498433 */
  Mali_WrReg(0x1,0x0,0x304,0x34561324);              /* writereg 10000304 34561324 */
  Mali_WrReg(0x1,0x0,0x308,0x56756534);              /* writereg 10000308 56756534 */
  Mali_WrReg(0x1,0x0,0x30c,0x57623400);              /* writereg 1000030c 57623400 # Setting high/low part at same time is undefined */
  Mali_WrReg(0x1,0x0,0x310,0x76763220);              /* writereg 10000310 76763220 */
  Mali_WrReg(0x1,0x0,0x314,0x54765524);              /* writereg 10000314 54765524 */
  Mali_WrReg(0x1,0x0,0x318,0x03425603);              /* writereg 10000318 03425603 */
  Mali_WrReg(0x1,0x0,0x31c,0x23460125);              /* writereg 1000031c 23460125 */
  Mali_WrReg(0x1,0x0,0x320,0x654aa236);              /* writereg 10000320 654aa236 */
  Mali_WrReg(0x1,0x0,0x324,0x6534534b);              /* writereg 10000324 6534534b */
  Mali_WrReg(0x1,0x0,0x328,0xbb654bb6);              /* writereg 10000328 bb654bb6 */
  Mali_WrReg(0x1,0x0,0x32c,0x654c654c);              /* writereg 1000032c 654c654c */
  /* COMMENT */                                      /* #- Management registers */
  Mali_WrReg(0x1,0x0,0x1000,0x00ccc654);             /* writereg 10001000 00ccc654 */
  Mali_WrReg(0x1,0x0,0x1004,0xd65d46d0);             /* writereg 10001004 d65d46d0 */
  Mali_WrReg(0x1,0x0,0x1008,0x65446665);             /* writereg 10001008 65446665 */
  /* COMMENT */                                      /* # Skip Control Management register at 0x100c */
  Mali_WrReg(0x1,0x0,0x1010,0xd654d654);             /* writereg 10001010 d654d654 */
  Mali_WrReg(0x1,0x0,0x1014,0xa6546d5d);             /* writereg 10001014 a6546d5d */
  Mali_WrReg(0x1,0x0,0x1018,0x6a54567d);             /* writereg 10001018 6a54567d */
  Mali_WrReg(0x1,0x0,0x101c,0x6ad5d56a);             /* writereg 1000101c 6ad5d56a */
  Mali_WrReg(0x1,0x0,0x1020,0xd564b65d);             /* writereg 10001020 d564b65d */
  /* COMMENT */                                      /* # Skip Interrupt Clear register at 0x1024 */
  Mali_WrReg(0x1,0x0,0x1028,0x6d54d65b);             /* writereg 10001028 6d54d65b */
  Mali_WrReg(0x1,0x0,0x102c,0x0564d6b4);             /* writereg 1000102c 0564d6b4 */
  Mali_WrReg(0x1,0x0,0x1030,0xb654b6b4);             /* writereg 10001030 b654b6b4 */
  Mali_WrReg(0x1,0x0,0x1034,0xa65c46a4);             /* writereg 10001034 a65c46a4 */
  Mali_WrReg(0x1,0x0,0x1038,0xa65c4a65);             /* writereg 10001038 a65c4a65 */
  Mali_WrReg(0x1,0x0,0x103c,0xac654a65);             /* writereg 1000103c ac654a65 */
  Mali_WrReg(0x1,0x0,0x1040,0xa65c4a65);             /* writereg 10001040 a65c4a65 */
  Mali_WrReg(0x1,0x0,0x1044,0xdd5d5d4d);             /* writereg 10001044 dd5d5d4d */
  Mali_WrReg(0x1,0x0,0x1048,0xa65d4d6d);             /* writereg 10001048 a65d4d6d */
  Mali_WrReg(0x1,0x0,0x104c,0x6aa6a65d);             /* writereg 1000104c 6aa6a65d */
  Mali_WrReg(0x1,0x0,0x1050,0xb6b4b654);             /* writereg 10001050 b6b4b654 */
  Mali_WrReg(0x1,0x0,0x1054,0xbbb6f5f5);             /* writereg 10001054 bbb6f5f5 */
  Mali_WrReg(0x1,0x0,0x1058,0xff65f4f6);             /* writereg 10001058 ff65f4f6 */
  Mali_WrReg(0x1,0x0,0x105c,0xf6ff54ff);             /* writereg 1000105c f6ff54ff */
  Mali_WrReg(0x1,0x0,0x1060,0xff6f54f5);             /* writereg 10001060 ff6f54f5 */
  Mali_WrReg(0x1,0x0,0x1064,0xfff3f3ff);             /* writereg 10001064 fff3f3ff */
  Mali_WrReg(0x1,0x0,0x1068,0xaaafffbb);             /* writereg 10001068 aaafffbb */
  Mali_WrReg(0x1,0x0,0x106c,0xfffbbfff);             /* writereg 1000106c fffbbfff */
  Mali_WrReg(0x1,0x0,0x1070,0xfffddfff);             /* writereg 10001070 fffddfff */
  Mali_WrReg(0x1,0x0,0x1074,0xfdcdfdcd);             /* writereg 10001074 fdcdfdcd */
  Mali_WrReg(0x1,0x0,0x1078,0x06d54fd5);             /* writereg 10001078 06d54fd5 */
  Mali_WrReg(0x1,0x0,0x107c,0xddd0ccdf);             /* writereg 1000107c ddd0ccdf */
  Mali_WrReg(0x1,0x0,0x1080,0x65465466);             /* writereg 10001080 65465466 */
  Mali_WrReg(0x1,0x0,0x1084,0x43763764);             /* writereg 10001084 43763764 */
  Mali_WrReg(0x1,0x0,0x1088,0x34577772);             /* writereg 10001088 34577772 */
  Mali_WrReg(0x1,0x0,0x108c,0x25333445);             /* writereg 1000108c 25333445 */
  Mali_WrReg(0x1,0x0,0x1090,0x45766623);             /* writereg 10001090 45766623 */
  Mali_WrReg(0x1,0x0,0x1094,0x34555222);             /* writereg 10001094 34555222 */
  Mali_WrReg(0x1,0x0,0x1098,0x34567775);             /* writereg 10001098 34567775 */
  Mali_WrReg(0x1,0x0,0x109c,0x57745345);             /* writereg 1000109c 57745345 */
  Mali_WrReg(0x1,0x0,0x10a0,0x34545652);             /* writereg 100010a0 34545652 */
  Mali_WrReg(0x1,0x0,0x10a4,0x65493212);             /* writereg 100010a4 65493212 */
  Mali_WrReg(0x1,0x0,0x10a8,0x98784954);             /* writereg 100010a8 98784954 */
  Mali_WrReg(0x1,0x0,0x10ac,0x57466433);             /* writereg 100010ac 57466433 */
  Mali_WrReg(0x1,0x0,0x10b0,0x21231382);             /* writereg 100010b0 21231382 */
  Mali_WrReg(0x1,0x0,0x10b4,0x13284236);             /* writereg 100010b4 13284236 */
  Mali_WrReg(0x1,0x0,0x10b8,0x12305433);             /* writereg 100010b8 12305433 */
  Mali_WrReg(0x1,0x0,0x10bc,0x34256455);             /* writereg 100010bc 34256455 */
  /* COMMENT */                                      /* #- Dump */
  res |= Check_m400_pp_3_ibr02_check_0_k();          /* dump_reg 10000000 10000058 > ibr02_00020_reg.hex # Frame registers */
  res |= Check_m400_pp_3_ibr02_check_0_l();          /* dump_reg 10000100 10000130 > ibr02_00021_reg.hex # Writeback Registers for WB0 */
  res |= Check_m400_pp_3_ibr02_check_0_m();          /* dump_reg 10000200 10000230 > ibr02_00022_reg.hex # Writeback Registers for WB1 */
  res |= Check_m400_pp_3_ibr02_check_0_n();          /* dump_reg 10000300 10000330 > ibr02_00023_reg.hex # Writeback Registers for WB2 */
  res |= Check_m400_pp_3_ibr02_check_0_o();          /* dump_reg 10001000 100010b8 > ibr02_00024_reg.hex # Management registers */
  Mali_MaskAllInterrupts();                          /* quit */
  mali_step++;
  return res;
}

